ekawahyu/Arduino_Core_STM32/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification

menu.board_part_num=Board part number

menu.xserial=Serial interface
menu.usb=USB interface

menu.upload_method=Upload method

################################################################################
# Nucleo 144 boards

Nucleo_144.name=Nucleo-144

Nucleo_144.build.vid=0x0483
Nucleo_144.build.pid=0x5711
Nucleo_144.vid.0=0x0483
Nucleo_144.pid.0=0x5711

Nucleo_144.build.core=arduino
Nucleo_144.build.board=Nucleo_144
Nucleo_144.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.enable_Serialx}

# NUCLEO_F207ZG board
# Support: USB HID, Serial1 (USART1 on PG9, PG14) and Serial2 (USART2 on PD6, PD5)
Nucleo_144.menu.board_part_num.NUCLEO_F207ZG=Nucleo F207ZG
Nucleo_144.menu.board_part_num.NUCLEO_F207ZG.node=NODE_F207ZG
Nucleo_144.menu.board_part_num.NUCLEO_F207ZG.upload.maximum_size=1048576
Nucleo_144.menu.board_part_num.NUCLEO_F207ZG.upload.maximum_data_size=131072
Nucleo_144.menu.board_part_num.NUCLEO_F207ZG.build.mcu=cortex-m3
Nucleo_144.menu.board_part_num.NUCLEO_F207ZG.build.f_cpu=120000000L
Nucleo_144.menu.board_part_num.NUCLEO_F207ZG.build.board=NUCLEO_F207ZG
Nucleo_144.menu.board_part_num.NUCLEO_F207ZG.build.series=STM32F2xx
Nucleo_144.menu.board_part_num.NUCLEO_F207ZG.build.product_line=STM32F207xx
Nucleo_144.menu.board_part_num.NUCLEO_F207ZG.build.variant=NUCLEO_F207ZG
Nucleo_144.menu.board_part_num.NUCLEO_F207ZG.build.cmsis_lib_gcc=arm_cortexM3l_math

# NUCLEO_F429ZI board
# Support: USB HID, Serial1 (USART1 on PG9, PG14) and Serial2 (USART2 on PD6, PD5)
Nucleo_144.menu.board_part_num.NUCLEO_F429ZI=Nucleo F429ZI
Nucleo_144.menu.board_part_num.NUCLEO_F429ZI.node=NODE_F429ZI
Nucleo_144.menu.board_part_num.NUCLEO_F429ZI.upload.maximum_size=2097152
Nucleo_144.menu.board_part_num.NUCLEO_F429ZI.upload.maximum_data_size=262144
Nucleo_144.menu.board_part_num.NUCLEO_F429ZI.build.mcu=cortex-m4
Nucleo_144.menu.board_part_num.NUCLEO_F429ZI.build.f_cpu=16000000L
Nucleo_144.menu.board_part_num.NUCLEO_F429ZI.build.board=NUCLEO_F429ZI
Nucleo_144.menu.board_part_num.NUCLEO_F429ZI.build.series=STM32F4xx
Nucleo_144.menu.board_part_num.NUCLEO_F429ZI.build.product_line=STM32F429xx
Nucleo_144.menu.board_part_num.NUCLEO_F429ZI.build.variant=NUCLEO_F429ZI
Nucleo_144.menu.board_part_num.NUCLEO_F429ZI.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
Nucleo_144.menu.upload_method.MassStorageMethod=Mass Storage
Nucleo_144.menu.upload_method.MassStorageMethod.upload.protocol=
Nucleo_144.menu.upload_method.MassStorageMethod.upload.tool=massStorageCopy

Nucleo_144.menu.upload_method.STLinkMethod=STLink
Nucleo_144.menu.upload_method.STLinkMethod.upload.protocol=STLink
Nucleo_144.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

################################################################################
# Nucleo 64 boards

Nucleo_64.name=Nucleo-64

Nucleo_64.build.vid=0x0483
Nucleo_64.build.pid=0x5711
Nucleo_64.vid.0=0x0483
Nucleo_64.pid.0=0x5711

Nucleo_64.build.core=arduino
Nucleo_64.build.board=Nucleo_64
Nucleo_64.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.enable_Serialx}

# NUCLEO_F030R8 board
# Support: Serial1 (USART1 on PA10, PA9)
Nucleo_64.menu.board_part_num.NUCLEO_F030R8=Nucleo F030R8
Nucleo_64.menu.board_part_num.NUCLEO_F030R8.node="NODE_F030R8,NUCLEO"
Nucleo_64.menu.board_part_num.NUCLEO_F030R8.upload.maximum_size=65536
Nucleo_64.menu.board_part_num.NUCLEO_F030R8.upload.maximum_data_size=8192
Nucleo_64.menu.board_part_num.NUCLEO_F030R8.build.mcu=cortex-m0
Nucleo_64.menu.board_part_num.NUCLEO_F030R8.build.f_cpu=48000000L
Nucleo_64.menu.board_part_num.NUCLEO_F030R8.build.board=NUCLEO_F030R8
Nucleo_64.menu.board_part_num.NUCLEO_F030R8.build.series=STM32F0xx
Nucleo_64.menu.board_part_num.NUCLEO_F030R8.build.product_line=STM32F030x8
Nucleo_64.menu.board_part_num.NUCLEO_F030R8.build.variant=NUCLEO_F030R8
Nucleo_64.menu.board_part_num.NUCLEO_F030R8.build.cmsis_lib_gcc=arm_cortexM0l_math

# NUCLEO_F091RC board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART2 on PA1, PA0)
Nucleo_64.menu.board_part_num.NUCLEO_F091RC=Nucleo F091RC
Nucleo_64.menu.board_part_num.NUCLEO_F091RC.node=NODE_F091RC
Nucleo_64.menu.board_part_num.NUCLEO_F091RC.upload.maximum_size=262144
Nucleo_64.menu.board_part_num.NUCLEO_F091RC.upload.maximum_data_size=32768
Nucleo_64.menu.board_part_num.NUCLEO_F091RC.build.mcu=cortex-m0
Nucleo_64.menu.board_part_num.NUCLEO_F091RC.build.f_cpu=8000000L
Nucleo_64.menu.board_part_num.NUCLEO_F091RC.build.board=NUCLEO_F091RC
Nucleo_64.menu.board_part_num.NUCLEO_F091RC.build.series=STM32F0xx
Nucleo_64.menu.board_part_num.NUCLEO_F091RC.build.product_line=STM32F091xC
Nucleo_64.menu.board_part_num.NUCLEO_F091RC.build.variant=NUCLEO_F091RC
Nucleo_64.menu.board_part_num.NUCLEO_F091RC.build.cmsis_lib_gcc=arm_cortexM0l_math

# NUCLEO_F103RB board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART3 on PC11, PC10)
Nucleo_64.menu.board_part_num.NUCLEO_F103RB=Nucleo F103RB
Nucleo_64.menu.board_part_num.NUCLEO_F103RB.node="NODE_F103RB,NUCLEO"
Nucleo_64.menu.board_part_num.NUCLEO_F103RB.upload.maximum_size=131072
Nucleo_64.menu.board_part_num.NUCLEO_F103RB.upload.maximum_data_size=20480
Nucleo_64.menu.board_part_num.NUCLEO_F103RB.build.mcu=cortex-m3
Nucleo_64.menu.board_part_num.NUCLEO_F103RB.build.f_cpu=72000000L
Nucleo_64.menu.board_part_num.NUCLEO_F103RB.build.board=NUCLEO_F103RB
Nucleo_64.menu.board_part_num.NUCLEO_F103RB.build.series=STM32F1xx
Nucleo_64.menu.board_part_num.NUCLEO_F103RB.build.product_line=STM32F103xB
Nucleo_64.menu.board_part_num.NUCLEO_F103RB.build.variant=NUCLEO_F103RB
Nucleo_64.menu.board_part_num.NUCLEO_F103RB.build.cmsis_lib_gcc=arm_cortexM3l_math

# NUCLEO_F303RE board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART2 on PA1, PA0)
Nucleo_64.menu.board_part_num.NUCLEO_F303RE=Nucleo F303RE
Nucleo_64.menu.board_part_num.NUCLEO_F303RE.node=NODE_F303RE
Nucleo_64.menu.board_part_num.NUCLEO_F303RE.upload.maximum_size=524288
Nucleo_64.menu.board_part_num.NUCLEO_F303RE.upload.maximum_data_size=65536
Nucleo_64.menu.board_part_num.NUCLEO_F303RE.build.mcu=cortex-m4
Nucleo_64.menu.board_part_num.NUCLEO_F303RE.build.f_cpu=8000000L
Nucleo_64.menu.board_part_num.NUCLEO_F303RE.build.board=NUCLEO_F303RE
Nucleo_64.menu.board_part_num.NUCLEO_F303RE.build.series=STM32F3xx
Nucleo_64.menu.board_part_num.NUCLEO_F303RE.build.product_line=STM32F303xE
Nucleo_64.menu.board_part_num.NUCLEO_F303RE.build.variant=NUCLEO_F303RE
Nucleo_64.menu.board_part_num.NUCLEO_F303RE.build.cmsis_lib_gcc=arm_cortexM4l_math

# NUCLEO_F401RE board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART2 on PA1, PA0)
Nucleo_64.menu.board_part_num.NUCLEO_F401RE=Nucleo F401RE
Nucleo_64.menu.board_part_num.NUCLEO_F401RE.node=NODE_F401RE
Nucleo_64.menu.board_part_num.NUCLEO_F401RE.upload.maximum_size=524288
Nucleo_64.menu.board_part_num.NUCLEO_F401RE.upload.maximum_data_size=98304
Nucleo_64.menu.board_part_num.NUCLEO_F401RE.build.mcu=cortex-m4
Nucleo_64.menu.board_part_num.NUCLEO_F401RE.build.f_cpu=84000000L
Nucleo_64.menu.board_part_num.NUCLEO_F401RE.build.board=NUCLEO_F401RE
Nucleo_64.menu.board_part_num.NUCLEO_F401RE.build.series=STM32F4xx
Nucleo_64.menu.board_part_num.NUCLEO_F401RE.build.product_line=STM32F401xE
Nucleo_64.menu.board_part_num.NUCLEO_F401RE.build.variant=NUCLEO_F401RE
Nucleo_64.menu.board_part_num.NUCLEO_F401RE.build.cmsis_lib_gcc=arm_cortexM4l_math

# NUCLEO_F411RE board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART2 on PC7, PC6)
Nucleo_64.menu.board_part_num.NUCLEO_F411RE=Nucleo F411RE
Nucleo_64.menu.board_part_num.NUCLEO_F411RE.node=NODE_F411RE
Nucleo_64.menu.board_part_num.NUCLEO_F411RE.upload.maximum_size=524288
Nucleo_64.menu.board_part_num.NUCLEO_F411RE.upload.maximum_data_size=131072
Nucleo_64.menu.board_part_num.NUCLEO_F411RE.build.mcu=cortex-m4
Nucleo_64.menu.board_part_num.NUCLEO_F411RE.build.f_cpu=100000000L
Nucleo_64.menu.board_part_num.NUCLEO_F411RE.build.board=NUCLEO_F411RE
Nucleo_64.menu.board_part_num.NUCLEO_F411RE.build.series=STM32F4xx
Nucleo_64.menu.board_part_num.NUCLEO_F411RE.build.product_line=STM32F411xE
Nucleo_64.menu.board_part_num.NUCLEO_F411RE.build.variant=NUCLEO_F411RE
Nucleo_64.menu.board_part_num.NUCLEO_F411RE.build.cmsis_lib_gcc=arm_cortexM4l_math

# NUCLEO_L053R8 board
# Support: Serial1 (USART1 on PA10, PA9)
Nucleo_64.menu.board_part_num.NUCLEO_L053R8=Nucleo L053R8
Nucleo_64.menu.board_part_num.NUCLEO_L053R8.node=NODE_L053R8
Nucleo_64.menu.board_part_num.NUCLEO_L053R8.upload.maximum_size=65536
Nucleo_64.menu.board_part_num.NUCLEO_L053R8.upload.maximum_data_size=8192
Nucleo_64.menu.board_part_num.NUCLEO_L053R8.build.mcu=cortex-m0
Nucleo_64.menu.board_part_num.NUCLEO_L053R8.build.f_cpu=2000000L
Nucleo_64.menu.board_part_num.NUCLEO_L053R8.build.board=NUCLEO_L053R8
Nucleo_64.menu.board_part_num.NUCLEO_L053R8.build.series=STM32L0xx
Nucleo_64.menu.board_part_num.NUCLEO_L053R8.build.product_line=STM32L053xx
Nucleo_64.menu.board_part_num.NUCLEO_L053R8.build.variant=NUCLEO_L053R8
Nucleo_64.menu.board_part_num.NUCLEO_L053R8.build.cmsis_lib_gcc=arm_cortexM0l_math
Nucleo_64.menu.board_part_num.NUCLEO_L053R8.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.enable_Serialx} -D__CORTEX_SC=0

# NUCLEO_L152RE board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (UART4 on PC11, PC10)
Nucleo_64.menu.board_part_num.NUCLEO_L152RE=Nucleo L152RE
Nucleo_64.menu.board_part_num.NUCLEO_L152RE.node="NODE_L152RE,NUCLEO"
Nucleo_64.menu.board_part_num.NUCLEO_L152RE.upload.maximum_size=524288
Nucleo_64.menu.board_part_num.NUCLEO_L152RE.upload.maximum_data_size=81920
Nucleo_64.menu.board_part_num.NUCLEO_L152RE.build.mcu=cortex-m3
Nucleo_64.menu.board_part_num.NUCLEO_L152RE.build.f_cpu=32000000L
Nucleo_64.menu.board_part_num.NUCLEO_L152RE.build.board=NUCLEO_L152RE
Nucleo_64.menu.board_part_num.NUCLEO_L152RE.build.series=STM32L1xx
Nucleo_64.menu.board_part_num.NUCLEO_L152RE.build.product_line=STM32L152xE
Nucleo_64.menu.board_part_num.NUCLEO_L152RE.build.variant=NUCLEO_L152RE
Nucleo_64.menu.board_part_num.NUCLEO_L152RE.build.cmsis_lib_gcc=arm_cortexM3l_math

# NUCLEO_L476RG board
# Support: Serial1 (USART1 on PA10, PA9)
Nucleo_64.menu.board_part_num.NUCLEO_L476RG=Nucleo L476RG
Nucleo_64.menu.board_part_num.NUCLEO_L476RG.node=NODE_L476RG
Nucleo_64.menu.board_part_num.NUCLEO_L476RG.upload.maximum_size=1048576
Nucleo_64.menu.board_part_num.NUCLEO_L476RG.upload.maximum_data_size=131072
Nucleo_64.menu.board_part_num.NUCLEO_L476RG.build.mcu=cortex-m4
Nucleo_64.menu.board_part_num.NUCLEO_L476RG.build.f_cpu=80000000L
Nucleo_64.menu.board_part_num.NUCLEO_L476RG.build.board=NUCLEO_L476RG
Nucleo_64.menu.board_part_num.NUCLEO_L476RG.build.series=STM32L4xx
Nucleo_64.menu.board_part_num.NUCLEO_L476RG.build.product_line=STM32L476xx
Nucleo_64.menu.board_part_num.NUCLEO_L476RG.build.variant=NUCLEO_L476RG
Nucleo_64.menu.board_part_num.NUCLEO_L476RG.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
Nucleo_64.menu.upload_method.MassStorageMethod=Mass Storage
Nucleo_64.menu.upload_method.MassStorageMethod.upload.protocol=
Nucleo_64.menu.upload_method.MassStorageMethod.upload.tool=massStorageCopy

Nucleo_64.menu.upload_method.STLinkMethod=STLink
Nucleo_64.menu.upload_method.STLinkMethod.upload.protocol=STLink
Nucleo_64.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

################################################################################
# Nucleo 32 boards

Nucleo_32.name=Nucleo-32

